cdb2sql> insert into t values (40)
(rows inserted=1)
[insert into t values (40)] rc 0
cdb2sql> insert into t values (20)
(rows inserted=1)
[insert into t values (20)] rc 0
cdb2sql> insert into t values (30)
(rows inserted=1)
[insert into t values (30)] rc 0
cdb2sql> insert into t values (10)
(rows inserted=1)
[insert into t values (10)] rc 0
cdb2sql> insert into t values (50)
(rows inserted=1)
[insert into t values (50)] rc 0
cdb2sql> select * from t order by id limit 4
(id=10)
(id=20)
(id=30)
(id=40)
[select * from t order by id limit 4] rc 0
cdb2sql> set readonly on
[set readonly on] rc 0
cdb2sql> select * from t order by id limit 4
(id=10)
(id=20)
(id=30)
(id=40)
[select * from t order by id limit 4] rc 0
cdb2sql> 