/* ------------------------------------------------------------------ */
/* Decimal Floating Point Abstraction Layer (DFPAL)                   */
/* ppcdfp.h                                                           */
/* ------------------------------------------------------------------ */
/* (c) Copyright IBM Corporation, 2007.  All rights reserved.         */
/*                                                                    */
/* This software is made available under the terms of the             */
/* ICU License -- ICU 1.8.1 and later.                                */
/*                                                                    */
/* The description and User's Guide ("The DFPAL C Library") for       */
/* this software is called dfpalugaio.html.  This document is         */
/* included in this package and also available at:                    */
/* http://www2.hursley.ibm.com/decimal                                */
/*                                                                    */
/* Author:                                                            */
/*   Punit Shah (punit@us.ibm.com)                                    */
/*                                                                    */
/* Please send comments, suggestions, and corrections to the          */
/* the following email address:                                       */
/*   dfpal-l@austin.ibm.com                                           */
/*                                                                    */
/* Major contribution:                                                */
/*   Ian McIntosh (ianm@ca.ibm.com)                                   */
/*   Calvin Sze (calvins@us.ibm.com)                                  */
/* ------------------------------------------------------------------ */

/* ------------------------------------------------------------------ */
/* This MUST be compiled with 128-bit long doubles for dfp_quad       */
/* to work!                                                           */
/* ------------------------------------------------------------------ */

/* ------------------------------------------------------------------ */
/* These functions work on decimal floating point values, disguised   */
/* as binary floating point types.  Typedefs dfp_double and dfp_quad  */
/* are used to slightly reduce the confusion.                         */
/* These values should NEVER be used as binary floating point, because*/
/* they are not.  Treating them as binary will give incorrect results.*/
/*                                                                    */
/* An understanding of the hardware is useful in using these functions*/
/* See ibmdfp.h for correct parameter and result usage.               */
/* ------------------------------------------------------------------ */


#if !defined(__PPCDFP_H__)
#define __PPCDFP_H__

#include "dfpaltypes.h"

/***************************************/
/* decimal floating point pseudo types */
/***************************************/

typedef float       dfp_single;
typedef double      dfp_double;
/*
 * dfp_quad defintion is in dfpaltypes.h for portability reasons, to 
 * support platforms/compilers with no 'long double' datatype
 */
#if defined (STAND_ALONE_PPCDFP_H)
  typedef long double dfp_quad;
#endif

typedef union dfp_single_parameter_u {
  struct dfp_single_parameter_s {
    int        pad;  /* padding need not be initialized          */
    dfp_single f;    /* set this to the desired dfp_single value */
  } f;
  dfp_double d;      /* then pass this as the parameter          */
} dfp_single_parameter;

/* padding to align quad precision parameters */

typedef dfp_double dfp_pad;  /* to align to even/odd register pair */

/* integer in floating point register */

typedef dfp_double dfp_integer_in_double;

typedef union dfp_integer_u {
  signed long long      sll;      /* set this                        */
  unsigned long long    ull;      /* or this to the desired value    */
  char                  bytes[8]; /* or these                        */
  dfp_integer_in_double d;        /* then pass this as the parameter */
  struct fpscr_u {
    unsigned upper28 : 28;
    unsigned drm     : 4;         /* or use this to access drm       */
    unsigned lower32 : 32;
  } fpscr;
} dfp_integer;

/* integer pair in floating point register pair */

typedef struct sllpair_s {
    signed long long upper;
    signed long long lower;
} signed_long_long_pair;

typedef struct ullpair_s {
    unsigned long long upper;
    unsigned long long lower;
} unsigned_long_long_pair;

typedef dfp_quad dfp_integer_pair_in_quad;

typedef union dfp_integer_pair_u {
  signed_long_long_pair       sll_pair;  /* extract this                 */
  unsigned_long_long_pair     ull_pair;  /* or this                      */
  char                        bytes[16]; /* or these                     */
  dfp_integer_pair_in_quad    q;         /* after setting this to result */
} dfp_integer_pair;

/* biased exponent */

typedef enum dfp_biased_exponent_e {
    biased_infinity         = -1,
    biased_quiet_NaN        = -2,
    biased_signaling_NaN    = -3,
    biased_minimum_exponent = 0
} dfp_biased_exponent;

typedef union dfp_biased_exponent_in_double_u {
  long long             e;  /* set this to the desired 64 bit value */
  dfp_integer_in_double d;  /* then pass this as the parameter      */
} dfp_biased_exponent_in_double;

typedef dfp_double dfp_significance_double;
typedef union dfp_significance_u {
  unsigned long long ull;     /* set this to the desired 6 bit integer value */
  dfp_significance_double d;  /* then pass this as the parameter             */
} dfp_significance;

/****************************************************/
/* FPSCR Floating Point Status and Control Register */
/****************************************************/

typedef union {
  dfp_integer all;
  struct ppc_fpscr_s {
    /* upper half */
    unsigned reserved_0_27 : 28; /*  0:27 - reserved */
    unsigned drn           :  4; /* 28:31 - Decimal Rounding Control */
    /* lower half */
    unsigned fx            :  1; /* 0 - FP Exception Summary                                     */
    unsigned fex           :  1; /* 1 - FP Enabled Exception Summary                             */
    unsigned vx            :  1; /* 2 - FP Invalid Operation Exception Summary                   */
    unsigned ox            :  1; /* 3 - FP Overflow Exception                                    */
    unsigned ux            :  1; /* 4 - FP Underflow Exception                                   */
    unsigned zx            :  1; /* 5 - FP Zero Divide Exception                                 */
    unsigned xx            :  1; /* 6 - FP Inexact Exception                                     */
    unsigned vxsnan        :  1; /* 7 - FP Invalid Operation Exception (SNaN)                    */
    unsigned vxisi         :  1; /* 8 - FP Invalid Operation Exception (Inf - Inf)               */
    unsigned vxidi         :  1; /* 9 - FP Invalid Operation Exception (Inf + Inf)               */
    unsigned vxzdz         :  1; /* 10 - FP Invalid Operation Exception (0 / 0)                   */
    unsigned vximz         :  1; /* 11 - FP Invalid Operation Exception (Inf x 0)                 */
    unsigned vxvc          :  1; /* 12 - FP Invalid Operation Exception (Invalid Compare)         */
    unsigned fr            :  1; /* 13 - FP Fraction Rounded                                      */
    unsigned fi            :  1; /* 14 - FP Fraction Inexact                                      */
  /*unsigned fprf          :  5;    15:19 - FP Result Flags                                       */
    unsigned c             :  1; /* 15    - FP Class Descriptor                                   */
  /*unsigned fpcc          :  4;    16:19 - FP Condition Code                                     */
    unsigned fl            :  1; /* 16    - FP Less Than or Negative                              */
    unsigned fg            :  1; /* 17    - FP Greater Than or Positive                           */
    unsigned fe            :  1; /* 18    - FP Equal or Zero                                      */
    unsigned fu            :  1; /* 19    - FP Unordered or NaN                                   */
    unsigned reserved_20   :  1; /* 20 - reserved                                                 */
    unsigned vxsoft        :  1; /* 21 - FP Invalid Operation Exception (Software Request)        */
    unsigned vxsqrt        :  1; /* 22 - FP Invalid Operation Exception (Invalid Square Root)     */
    unsigned vxcvi         :  1; /* 23 - FP Invalid Operation Exception (Invalid Integer Convert) */
    unsigned ve            :  1; /* 24 - FP Invalid Operation Exception Enable                    */
    unsigned oe            :  1; /* 25 - FP Overflow Exception Enable                             */
    unsigned ue            :  1; /* 26 - FP Underflow Exception Enable                            */
    unsigned ze            :  1; /* 27 - FP Zero Divide Exception Enable                          */
    unsigned xe            :  1; /* 28 - FP Inexact Exception Enable                              */
    unsigned ni            :  1; /* 29 - FP Non-IEEE Mode                                         */
    unsigned rn            :  2; /* 30:31 - (Binary) Rounding Control                             */
  } fpscr_attrib;
} ppc_fpscr;


#if defined (STAND_ALONE_PPCDFP_H)
typedef enum compare_result_e {
  DFPAL_COMP_LT = 8, /* 1000 */
  DFPAL_COMP_GT = 4, /* 0100 */
  DFPAL_COMP_EQ = 2, /* 0010 */
  DFPAL_COMP_UO = 1  /* 0001 = unordered */
} compare_result;
#endif

#if !defined(DFPAL_NO_HW_DFP) /* { */
#if defined(DFPAL_OS_AIX5L) || defined(DFPAL_OS_I5OS) \
  || defined(DFPAL_OS_LOP_XLC) /* { */

/************************/
/* Support Instructions */
/************************/

/* Floating Point Move Register */
/* fmr: opcode=63 frt frb subopcode=72=0x48 rc=0 */
/* fmr fr1=fr2: opcode=63=111111 frt=1=00001 fra=00000 frb=2=00010 subopcode=72=0x048=00_0100_1000 rc=0 = FC201090 */
